InformationRegisters/ГрафикиПриема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиПриема</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поликлиника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поликлиники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Врачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кабинеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Прием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Прием</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поликлиника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поликлиники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кабинеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Врачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПожеланиеНаПрием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПожеланиеНаПрием</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поликлиника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поликлиники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Врачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПациентОповещенОВозможностиЗаписиНаПрием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Рецепт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Рецепт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПациентОповещенОСкидке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Лекарства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Лекарство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МеждународныеНепатентованыеНаименования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льготное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/МодульРегламентныхЗаданий/Ext/Module.bsl
Процедура ПроверитьВозможностьЗаписиНаПрием() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПожеланиеНаПрием.Ссылка КАК ПожеланиеНаПрием,
	               |	ТБлижайшиеСвободныеДатыПриема.БлижайшаяДатаПриема КАК БлижайшаяДатаПриема,
	               |	ПожеланиеНаПрием.Пациент.ОповещатьЭлектроннымПисьмом КАК ОповещатьЭлектроннымПисьмом,
	               |	ПожеланиеНаПрием.Пациент.ОповещатьСМС КАК ОповещатьСМС,
	               |	ПожеланиеНаПрием.Пациент.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	               |	ПожеланиеНаПрием.Пациент.Телефон КАК Телефон,
	               |	ПожеланиеНаПрием.Пациент.Наименование КАК ИмяПациента,
	               |	ПожеланиеНаПрием.Врач.Наименование КАК ИмяВрача,
	               |	ПожеланиеНаПрием.Врач.Специализация.Наименование КАК СпециализацияВрача
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ГрафикиПриема.Поликлиника КАК Поликлиника,
	               |		ГрафикиПриема.Врач КАК Врач,
	               |		МИНИМУМ(ГрафикиПриема.Дата) КАК БлижайшаяДатаПриема
	               |	ИЗ
	               |		РегистрСведений.ГрафикиПриема КАК ГрафикиПриема
	               |	ГДЕ
	               |		ГрафикиПриема.Дата >= &Дата
	               |		И ГрафикиПриема.Прием = ЗНАЧЕНИЕ(Документ.Прием.ПустаяСсылка)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ГрафикиПриема.Поликлиника,
	               |		ГрафикиПриема.Врач) КАК ТБлижайшиеСвободныеДатыПриема
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПожеланиеНаПрием КАК ПожеланиеНаПрием
	               |		ПО ТБлижайшиеСвободныеДатыПриема.Поликлиника = ПожеланиеНаПрием.Поликлиника
	               |			И ТБлижайшиеСвободныеДатыПриема.Врач = ПожеланиеНаПрием.Врач
	               |ГДЕ
	               |	Не ПожеланиеНаПрием.ПометкаУдаления
	               |	И НЕ ПожеланиеНаПрием.ПациентОповещенОВозможностиЗаписиНаПрием";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(ТекущаяДата())+1);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПожеланиеОбъект = Выборка.ПожеланиеНаПрием.ПолучитьОбъект();
		ПожеланиеОбъект.ПациентОповещенОВозможностиЗаписиНаПрием = Истина;
		ПожеланиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Если Выборка.ОповещатьЭлектроннымПисьмом И ЗначениеЗаполнено(Выборка.ЭлектроннаяПочта) Тогда
			ОтправитьЭлектронноеПисьмоОВозможностиЗаписатьсяНаПрием(Выборка.ЭлектроннаяПочта, 
																	Выборка.ИмяВрача, 
																	Выборка.СпециализацияВрача, 
																	Выборка.БлижайшаяДатаПриема);	
		КонецЕсли;
																
		Если Выборка.ОповещатьСМС И ЗначениеЗаполнено(Выборка.Телефон) Тогда
			ОтправитьСМСОВозможностиЗаписатьсяНаПрием(Выборка.Телефон, 
													  Выборка.ИмяВрача, 
													  Выборка.СпециализацияВрача, 
													  Выборка.БлижайшаяДатаПриема);
		КонецЕсли;
															
	КонецЦикла;
		
КонецПроцедуры

Процедура ОтправитьЭлектронноеПисьмоОВозможностиЗаписатьсяНаПрием(ЭлектроннаяПочта, ИмяВрача, СпециализацияВрача, БлижайшаяДатаПриема)
	
	ТекстПисьма = СтрШаблон("Доступна запись к врачу %1(%2) начиная с %3", ИмяВрача, СпециализацияВрача, Формат(БлижайшаяДатаПриема, "ДФ=dd.MM.yyyy"));
	ЭлектроннаяПочтаКлиентСервер.ОтправитьПисьмо(ЭлектроннаяПочта, "Доступна запись к врачу", ТекстПисьма); 
	
КонецПроцедуры

Процедура ОтправитьСМСОВозможностиЗаписатьсяНаПрием(Телефон, ИмяВрача, СпециализацияВрача, БлижайшаяДатаПриема)
	
	ТекстСМС = СтрШаблон("Доступна запись к врачу %1(%2) начиная с %3", ИмяВрача, СпециализацияВрача, Формат(БлижайшаяДатаПриема, "ДФ=dd.MM.yyyy"));
	ОтправитьСМС(Телефон, ТекстСМС);	
	
КонецПроцедуры

Процедура ОповеститьПациентаОСкидке() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рецепт.Ссылка КАК Рецепт,
	               |	Рецепт.Номер КАК НомерРецепта,
	               |	Рецепт.Прием.Пациент.ОповещатьЭлектроннымПисьмом КАК ОповещатьЭлектроннымПисьмом,
	               |	Рецепт.Прием.Пациент.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
	               |	Рецепт.Прием.Пациент.Телефон КАК Телефон,
	               |	Рецепт.Прием.Пациент.ОповещатьСМС КАК ОповещатьСМС
	               |ИЗ
	               |	Документ.Рецепт КАК Рецепт
	               |ГДЕ
	               |	НЕ Рецепт.ПациентОповещенОСкидке";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РецептОбъект = Выборка.Рецепт.ПолучитьОбъект();
		РецептОбъект.ПациентОповещенОСкидке = Истина;
		РецептОбъект.Записать();                                                                        
		
		Если Выборка.ОповещатьЭлектроннымПисьмом И ЗначениеЗаполнено(Выборка.ЭлектроннаяПочта) Тогда
			ОтправитьЭлектронноеПисьмоОСкидке(Выборка.ЭлектроннаяПочта, Выборка.НомерРецепта);
		КонецЕсли;
		
		Если Выборка.ОповещатьСМС И ЗначениеЗаполнено(Выборка.Телефон) Тогда
			ОтправитьСМСОСкидке(Выборка.Телефон, Выборка.НомерРецепта);	
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОтправитьЭлектронноеПисьмоОСкидке(ЭлектроннаяПочта, НомерРецепта)
	
	ТекстПисьма = СтрШаблон("Доступна скидка в партнерских аптеках. Покажите СНИЛС и этот номер: %1", НомерРецепта);
	ЭлектроннаяПочтаКлиентСервер.ОтправитьПисьмо(ЭлектроннаяПочта, "Доступна скидка", ТекстПисьма);	
	
КонецПроцедуры

Процедура ОтправитьСМСОСкидке(Телефон, НомерРецепта) 
	
	ТекстСМС = СтрШаблон("Доступна скидка в партнерских аптеках. Покажите СНИЛС и этот номер: %1", НомерРецепта);
	ОтправитьСМС(Телефон, ТекстСМС);
	
КонецПроцедуры

Функция Отправить_СМС(Логин, Пароль, SMSArray, ИмяОтправ, GMT, ТолькоПроверить)
	Перем Определения;
	Перем Прокси;
	Перем xmlDoc;
	Перем nodeRoot;
	Перем Телефон1;
	Перем ResStruct;
	Перем ResArray;
	Перем Результат;
	Перем k;
	Перем Назначено;
	
	ResArray = новый массив;
	Попытка
		Определения = Новый WSОпределения("http://smpp3.websms.ru:8183/soap?WSDL");	
		Прокси      = Новый WSПрокси(Определения, "http://ws.com/", "WebsmsSoapServService", "WebsmsSoapServPort");
		xmlDoc = Новый COMОбъект("MSXML2.DOMDocument");
		Попытка
			Для k=0 По SMSArray.Количество()-1 Цикл
				Телефон1 = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(SMSArray[k].Получатель,"-",""),"(",""),")","")," ",""),"+","");	
				Если СтрДлина(Телефон1)>10  тогда
					ResStruct = Новый структура("id, IDСообщения, Состояние, ДатаРассылки"); 
					ResStruct.id = SMSArray[k].id;
					ResStruct.IDСообщения = 0;
					ResStruct.Состояние = "Не отправлено";
					ResStruct.ДатаРассылки = ТекущаяДата();
					Если SMSArray[k].ДатаРассылки = Неопределено Тогда
						Назначено = Формат(ТекущаяДата(),"ДФ=дд.ММ.гггг чч:мм");
					Иначе
						Назначено = Формат(SMSArray[k].ДатаРассылки,"ДФ=дд.ММ.гггг чч:мм");
					КонецЕсли;	
					Результат = Прокси.sendSMS( Логин, Пароль, ИмяОтправ, SMSArray[k].ТекстСообщения, Телефон1, 0, 0, Назначено, GMT, ТолькоПроверить); 
					// Сообщить(Результат);					
					xmlDoc.LoadXML(Результат);
					nodeRoot = xmlDoc.documentElement;
					Для Каждого nod ИЗ nodeRoot.childNodes Цикл
						Для Каждого chNod ИЗ nod.childNodes Цикл
							Если chNod.nodeName = "systemId" тогда 
								ResStruct.IDСообщения = chNod.text;
							КонецЕсли;
							Если chNod.nodeName = "state" тогда 
								ResStruct.Состояние = chNod.text;
								Если chNod.text = "Accepted" Тогда
									Если Число(ResStruct.IDСообщения)>0 Тогда
										ResStruct.Состояние = "Принято системой";
									Иначе
										ResStruct.Состояние = "Проверено";
									КонецЕсли;
								Иначе
									ResStruct.Состояние = "Отклонено";
								КонецЕсли;	
							КонецЕсли;
						КонецЦикла;	
					КонецЦикла;	
					ResArray.Добавить(ResStruct); 
				Иначе	
					Сообщить("Номер не может быть использован при отправке сообщения: "+Телефон1);
				КонецЕсли;
			КонецЦикла;
		Исключение
   			Сообщить(ОписаниеОшибки());
		КонецПопытки;	
	Исключение
	    Сообщить("Соединение с сервером websms не установлено. Проверьте соединение с сетью Интернет!");
	КонецПопытки;	
	
	Прокси = Неопределено;
	Определения = Неопределено;
	xmlDoc = Неопределено;
	Возврат ResArray;
КонецФункции

//отправка через сервис swebsms.ru 
//предварительно нужно зарегистрироваться, полочить логин-пароль, и зарегистрировать номер на который отправлять бесплатные смс
//количество бесплатных смс ограничено 30, в оригинальной обраотке есть команда отправить тест - использует эту функцию
Функция ОтправитьСМС(Получатель, ТекстСообщения) Экспорт
	Перем ИмяОтправ;
	Перем МассивСМС;
	Перем Резлт;
	Перем СтруктСМС; 
	Перем i;
	
	ДатаРассылки = ТекущаяДата()+60*2;
	
	ИД=1;
	
	ИмяОтправ = "WEBSMS";
		
	
	МассивСМС = новый массив;
	
	СтруктСМС = Новый структура("id, Получатель, ТекстСообщения, ДатаРассылки");
	СтруктСМС.id = ИД; 
	СтруктСМС.Получатель = Получатель; 
	СтруктСМС.ТекстСообщения = ТекстСообщения;             
	СтруктСМС.ДатаРассылки = ДатаРассылки;             
	МассивСМС.Добавить(СтруктСМС); 
	
		
	Резлт = Отправить_СМС("nolimits", "parol", МассивСМС, ИмяОтправ, 4, 0); 
	
	//Для i=0 По Резлт.Количество()-1 Цикл
	//	ТЗ_СМС[Резлт[i].id].Состояние    = Резлт[i].Состояние;  
	//	ТЗ_СМС[Резлт[i].id].IDСообщения  = Резлт[i].IDСообщения;  
	//	ТЗ_СМС[Резлт[i].id].ДатаРассылки = Резлт[i].ДатаРассылки;  
	//КонецЦикла;  	
КонецФункции
